Repository: aprendecomigo-edu/aprendecomigo
Catalog: locale/*/LC_MESSAGES/django.po
Languages: pt_pt

source: Accounts and User Management
pt_pt: Gestão de Contas e Utilizadores

source: Your 24-hour grace period has expired. Please verify your email or phone number to continue using Aprende Comigo.
pt_pt: O período de tolerância de 24 horas expirou. Por favor, verifique o seu endereço de email ou número de telemóvel para continuar a usar o Aprende Comigo.

source: Your email has been successfully verified!
pt_pt: O seu email foi verificado com sucesso!

source: Your phone has been successfully verified!
pt_pt: O seu telemóvel foi verificado com sucesso!

source: Year 1
pt_pt: 1.º Ano

source: Year 2
pt_pt: 2.º Ano

source: Year 3
pt_pt: 3.º Ano

source: Year 4
pt_pt: 4.º Ano

source: Year 5
pt_pt: 5.º Ano

source: Year 6
pt_pt: 6.º Ano

source: Year 7
pt_pt: 7.º Ano

source: Year 8
pt_pt: 8.º Ano

source: Year 9
pt_pt: 9.º Ano

source: Year 10
pt_pt: 10.º Ano

source: Year 11
pt_pt: 11.º Ano

source: Year 12
pt_pt: 12.º Ano

source: Basic Education 1st Cycle
pt_pt: 1.º Ciclo do Ensino Básico

source: Basic Education 2nd Cycle
pt_pt: 2.º Ciclo do Ensino Básico

source: Basic Education 3rd Cycle
pt_pt: 3.º Ciclo do Ensino Básico

source: Secondary Education
pt_pt: Ensino Secundário

source: Grade 1
pt_pt: 1.º Ano

source: Grade 2
pt_pt: 2.º Ano

source: Grade 3
pt_pt: 3.º Ano

source: Grade 4
pt_pt: 4.º Ano

source: Grade 5
pt_pt: 5.º Ano

source: Grade 6
pt_pt: 6.º Ano

source: Grade 7
pt_pt: 7.º Ano

source: Grade 8
pt_pt: 8.º Ano

source: Grade 9
pt_pt: 9.º Ano

source: Grade 10
pt_pt: 10.º Ano

source: Grade 11
pt_pt: 11.º Ano

source: Grade 12
pt_pt: 12.º Ano

source: Elementary
pt_pt: Ensino Básico

source: Middle School
pt_pt: 2.º e 3.º Ciclos

source: High School
pt_pt: Ensino Secundário

source: Custom
pt_pt: Personalizado

source: system name
pt_pt: nome do sistema

source: Name of the educational system (e.g., 'Portugal')
pt_pt: Nome do sistema educativo (ex: 'Portugal')

source: system code
pt_pt: código do sistema

source: Unique code for the system (e.g., 'pt')
pt_pt: Código único para o sistema (ex: 'pt')

source: description
pt_pt: descrição

source: Description of the educational system
pt_pt: Descrição do sistema educativo

source: is active
pt_pt: está ativo

source: Educational System
pt_pt: Sistema Educativo

source: Educational Systems
pt_pt: Sistemas Educativos

source: course name
pt_pt: nome do curso

source: course code
pt_pt: código do curso

source: Alphanumeric code for the course (e.g., educational system codes)
pt_pt: Código alfanumérico para o curso (ex: códigos do sistema educativo)

source: Educational system this course belongs to
pt_pt: Sistema educativo a que este curso pertence

source: education level
pt_pt: nível de ensino

source: Education level within the educational system
pt_pt: Nível de ensino dentro do sistema educativo

source: course description
pt_pt: descrição do curso

source: Detailed description of the course content and objectives
pt_pt: Descrição detalhada do conteúdo e objetivos do curso

source: hourly rate for this course
pt_pt: tarifa horária para este curso

source: Specific hourly rate for this course (overrides teacher's default rate)
pt_pt: Tarifa horária específica para este curso (substitui a tarifa padrão do professor)

source: is actively teaching
pt_pt: está ativamente a ensinar

source: started teaching date
pt_pt: data de início de ensino

source: School Owner
pt_pt: Proprietário da Escola

source: School Administrator
pt_pt: Administrador Escolar

source: Teacher
pt_pt: Professor

source: School Staff
pt_pt: Pessoal Escolar

source: Student
pt_pt: Aluno

source: Guardian
pt_pt: Encarregado de Educação

source: Invitation Sent
pt_pt: Convite Enviado

source: Invitation Accepted
pt_pt: Convite Aceite

source: Invitation Declined
pt_pt: Convite Recusado

source: Student Joined
pt_pt: Aluno Inscrito

source: Teacher Joined
pt_pt: Professor Inscrito

source: Class Created
pt_pt: Aula Criada

source: Class Completed
pt_pt: Aula Concluída

source: Class Cancelled
pt_pt: Aula Cancelada

source: Settings Updated
pt_pt: Definições Atualizadas

source: School
pt_pt: Escola

source: Split
pt_pt: Dividir

source: US Dollar
pt_pt: Dólar Americano

source: Brazilian Real
pt_pt: Real Brasileiro

source: British Pound
pt_pt: Libra Esterlina

source: Portuguese
pt_pt: Português

source: English
pt_pt: Inglês

source: Spanish
pt_pt: Espanhol

source: French
pt_pt: Francês

source: None
pt_pt: Nenhum

source: 1 Year
pt_pt: 1 Ano

source: 2 Years
pt_pt: 2 Anos

source: 5 Years
pt_pt: 5 Anos

source: Indefinite
pt_pt: Indefinido

source: Not Sent
pt_pt: Não Enviado

source: Queued
pt_pt: Em Fila

source: Sending
pt_pt: A Enviar

source: Sent
pt_pt: Enviado

source: Delivered
pt_pt: Entregue

source: Opened
pt_pt: Aberto

source: Clicked
pt_pt: Clicado

source: Failed
pt_pt: Falhado

source: Pending
pt_pt: Pendente

source: Viewed
pt_pt: Visualizado

source: Accepted
pt_pt: Aceite

source: Declined
pt_pt: Recusado

source: Expired
pt_pt: Expirado

source: Cancelled
pt_pt: Cancelado

source: email address
pt_pt: endereço de email

source: role
pt_pt: função

source: is accepted
pt_pt: é aceite

source: usage count
pt_pt: contagem de utilização

source: max uses
pt_pt: máximo de utilizações

source: Leave blank for unlimited uses
pt_pt: Deixe em branco para utilizações ilimitadas

source: custom message
pt_pt: mensagem personalizada

source: Personal message to include in the invitation
pt_pt: Mensagem pessoal a incluir no convite

source: batch ID
pt_pt: ID do lote

source: UUID to group related invitations together
pt_pt: UUID para agrupar convites relacionados

source: status
pt_pt: estado

source: email delivery status
pt_pt: estado de entrega do email

source: email sent at
pt_pt: email enviado em

source: email delivered at
pt_pt: email entregue em

source: email failure reason
pt_pt: razão da falha do email

source: retry count
pt_pt: contagem de tentativas

source: max retries
pt_pt: máximo de tentativas

source: accepted at
pt_pt: aceite em

source: declined at
pt_pt: recusado em

source: When the invitation was declined
pt_pt: Quando o convite foi recusado

source: viewed at
pt_pt: visualizado em

source: When the invitation was first viewed
pt_pt: Quando o convite foi visualizado pela primeira vez

source: Teacher Invitation
pt_pt: Convite de Professor

source: Teacher Invitations
pt_pt: Convites de Professor

source: biography
pt_pt: biografia

source: Teacher's professional biography
pt_pt: Biografia profissional do professor

source: specialty
pt_pt: especialidade

source: education
pt_pt: formação

source: Educational background and qualifications
pt_pt: Formação académica e qualificações

source: hourly rate
pt_pt: tarifa horária

source: availability
pt_pt: disponibilidade

source: Available days and times for lessons
pt_pt: Dias e horas disponíveis para aulas

source: address
pt_pt: morada

source: Street, number, postal code and location
pt_pt: Rua, número, código postal e localidade

source: teacher phone
pt_pt: telemóvel do professor

source: calendar iframe
pt_pt: iframe do calendário

source: education background
pt_pt: formação académica

source: Structured educational background data (degree, institution, field, year)
pt_pt: Dados estruturados da formação académica (grau, instituição, área, ano)

source: teaching subjects
pt_pt: disciplinas que leciona

source: List of subjects the teacher specializes in
pt_pt: Lista de disciplinas em que o professor é especializado

source: rate structure
pt_pt: estrutura de tarifas

source: Detailed rate structure for different class types
pt_pt: Estrutura detalhada de tarifas para diferentes tipos de aulas

source: weekly availability
pt_pt: disponibilidade semanal

source: Structured weekly availability schedule
pt_pt: Horário de disponibilidade semanal estruturado

source: grade level preferences
pt_pt: preferências de anos escolares

source: List of preferred grade levels (elementary, middle, high school, university)
pt_pt: Lista de níveis de ensino preferidos (básico, 2.º e 3.º ciclos, secundário, universitário)

source: teaching experience
pt_pt: experiência de ensino

source: Structured teaching experience data (years, institutions, specializations)
pt_pt: Dados estruturados da experiência de ensino (anos, instituições, especializações)

source: credentials documents
pt_pt: documentos de credenciais

source: List of uploaded credential document references
pt_pt: Lista de referências de documentos de credenciais carregados

source: availability schedule
pt_pt: horário de disponibilidade

source: Detailed availability schedule with time slots and preferences
pt_pt: Horário detalhado de disponibilidade com horários e preferências

source: last profile update
pt_pt: última atualização do perfil

source: When the profile was last updated
pt_pt: Quando o perfil foi atualizado pela última vez

source: last activity
pt_pt: última atividade

source: When the teacher was last active in the system
pt_pt: Quando o professor esteve ativo pela última vez no sistema

source: minimum notice minutes
pt_pt: minutos de aviso mínimo

source: Override minimum notice period in minutes (school default if null)
pt_pt: Substituir período mínimo de aviso em minutos (padrão da escola se vazio)

source: buffer time minutes
pt_pt: minutos de intervalo

source: Buffer time between classes in minutes (school default if null)
pt_pt: Tempo de intervalo entre aulas em minutos (padrão da escola se vazio)

source: maximum daily bookings
pt_pt: máximo de marcações diárias

source: Maximum classes per day (school default if null)
pt_pt: Máximo de aulas por dia (padrão da escola se vazio)

source: maximum weekly bookings
pt_pt: máximo de marcações semanais

source: Maximum classes per week (school default if null)
pt_pt: Máximo de aulas por semana (padrão da escola se vazio)

source: User account for this student (null if guardian-only management)
pt_pt: Conta de utilizador para este aluno (vazio se gerido apenas pelo encarregado)

source: student name
pt_pt: nome do aluno

source: Student's full name (required for all students, especially guardian-only students without user accounts)
pt_pt: Nome completo do aluno (obrigatório para todos os alunos, especialmente os geridos apenas pelo encarregado sem contas de utilizador)

source: educational system
pt_pt: sistema educativo

source: Educational system this student belongs to
pt_pt: Sistema educativo a que este aluno pertence

source: school year
pt_pt: ano letivo

source: School year within the educational system
pt_pt: Ano letivo dentro do sistema educativo

source: birth date
pt_pt: data de nascimento

source: account type
pt_pt: tipo de conta

source: Defines who has accounts and manages this student
pt_pt: Define quem tem contas e gere este aluno

source: Guardian of the student (required for guardian-managed accounts)
pt_pt: Encarregado de educação do aluno (obrigatório para contas geridas pelo encarregado)

source: notes
pt_pt: notas

source: Additional notes about the student, special needs, etc.
pt_pt: Notas adicionais sobre o aluno, necessidades especiais, etc.

source: email notifications enabled
pt_pt: notificações por email ativadas

source: Enable email notifications for student alerts
pt_pt: Ativar notificações por email para alertas do aluno

source: SMS notifications enabled
pt_pt: notificações por SMS ativadas

source: Enable SMS notifications for student alerts
pt_pt: Ativar notificações por SMS para alertas do aluno

source: Student address (only for adult students)
pt_pt: Morada do aluno (apenas para alunos adultos)

source: tax number
pt_pt: número de contribuinte

source: Tax number (only for adult students)
pt_pt: Número de contribuinte (apenas para alunos adultos)

source: invoice
pt_pt: fatura

source: Whether to issue invoices (only for adult students)
pt_pt: Se deve emitir faturas (apenas para alunos adultos)

source: Adult students must have a user account.
pt_pt: Alunos adultos devem ter uma conta de utilizador.

source: Adult students should not have a guardian assigned.
pt_pt: Alunos adultos não devem ter um encarregado de educação atribuído.

source: Guardian-only students should not have a user account.
pt_pt: Alunos geridos apenas pelo encarregado não devem ter uma conta de utilizador.

source: Guardian-only students must have a guardian assigned.
pt_pt: Alunos geridos apenas pelo encarregado devem ter um encarregado de educação atribuído.

source: Student+Guardian accounts require the student to have a user account.
pt_pt: Contas Aluno+Encarregado requerem que o aluno tenha uma conta de utilizador.

source: Student+Guardian accounts require a guardian to be assigned.
pt_pt: Contas Aluno+Encarregado requerem que seja atribuído um encarregado de educação.

source: notification preferences
pt_pt: preferências de notificação

source: Guardian notification preferences (email, SMS, in-app)
pt_pt: Preferências de notificação do encarregado (email, SMS, na app)

source: default approval settings
pt_pt: definições de aprovação padrão

source: Default purchase approval settings for all studentren
pt_pt: Definições de aprovação de compras padrão para todos os alunos

source: Enable email notifications for guardian alerts
pt_pt: Ativar notificações por email para alertas do encarregado

source: Enable SMS notifications for guardian alerts
pt_pt: Ativar notificações por SMS para alertas do encarregado

source: Whether to issue invoices for this guardian
pt_pt: Se deve emitir faturas para este encarregado

source: guardian Profile
pt_pt: Perfil do Encarregado

source: guardian Profiles
pt_pt: Perfis dos Encarregados

source: guardian
pt_pt: encarregado

source: Guardian user who manages the student account
pt_pt: Utilizador encarregado que gere a conta do aluno

source: student
pt_pt: aluno

source: Student user whose account is managed by the guardian
pt_pt: Utilizador aluno cuja conta é gerida pelo encarregado

source: school
pt_pt: escola

source: School where this relationship is established
pt_pt: Escola onde esta relação é estabelecida

source: Whether this relationship is currently active
pt_pt: Se esta relação está atualmente ativa

source: requires purchase approval
pt_pt: requer aprovação de compra

source: Whether guardian approval is required for purchases
pt_pt: Se a aprovação do encarregado é necessária para compras

source: requires session approval
pt_pt: requer aprovação de sessão

source: Whether guardian approval is required for booking sessions
pt_pt: Se a aprovação do encarregado é necessária para marcar sessões

source: guardian-student Relationship
pt_pt: Relação Encarregado-Aluno

source: guardian-student Relationships
pt_pt: Relações Encarregado-Aluno

source: guardian and student cannot be the same user
pt_pt: encarregado e aluno não podem ser o mesmo utilizador

source: guardian must be a member of the school
pt_pt: encarregado deve ser membro da escola

source: student must be a member of the school
pt_pt: aluno deve ser membro da escola

source: Parent
pt_pt: Encarregado de Educação

source: name
pt_pt: nome

source: contact email
pt_pt: email de contacto

source: phone number
pt_pt: número de telemóvel

source: logo
pt_pt: logotipo

source: School logo image
pt_pt: Imagem do logotipo da escola

source: primary color
pt_pt: cor primária

source: Primary brand color in hex format
pt_pt: Cor primária da marca em formato hexadecimal

source: secondary color
pt_pt: cor secundária

source: Secondary brand color in hex format
pt_pt: Cor secundária da marca em formato hexadecimal

source: email domain
pt_pt: domínio de email

source: Official email domain for the school
pt_pt: Domínio de email oficial da escola

source: Educational system used by this school
pt_pt: Sistema educativo usado por esta escola

source: grade levels
pt_pt: níveis de ano

source: List of grade levels offered by this school
pt_pt: Lista de níveis de ano oferecidos por esta escola

source: billing contact name
pt_pt: nome do contacto de faturação

source: Name of billing contact person
pt_pt: Nome da pessoa de contacto para faturação

source: billing contact email
pt_pt: email de contacto de faturação

source: Email for billing-related communications
pt_pt: Email para comunicações relacionadas com faturação

source: billing address
pt_pt: morada de faturação

source: Billing address for invoices and payments
pt_pt: Morada de faturação para faturas e pagamentos

source: tax ID
pt_pt: NIF

source: Tax identification number for billing
pt_pt: Número de identificação fiscal para faturação

source: currency
pt_pt: moeda

source: Default currency for pricing and billing
pt_pt: Moeda padrão para preços e faturação

source: language
pt_pt: idioma

source: Default language for the school interface
pt_pt: Idioma padrão para a interface da escola

source: working hours start
pt_pt: início do horário de funcionamento

source: School working hours start time
pt_pt: Hora de início do funcionamento da escola

source: working hours end
pt_pt: fim do horário de funcionamento

source: School working hours end time
pt_pt: Hora de fim do funcionamento da escola

source: working days
pt_pt: dias de funcionamento

source: List of working days (0=Monday, 6=Sunday)
pt_pt: Lista de dias de funcionamento (0=Segunda, 6=Domingo)

source: Enable email notifications for school events
pt_pt: Ativar notificações por email para eventos da escola

source: Enable SMS notifications for school events
pt_pt: Ativar notificações por SMS para eventos da escola

source: allow student self-enrollment
pt_pt: permitir auto-inscrição de alunos

source: Allow students to enroll themselves
pt_pt: Permitir aos alunos inscreverem-se a si próprios

source: require parent approval
pt_pt: requerer aprovação dos pais

source: Require parental approval for student actions
pt_pt: Requerer aprovação dos pais para ações dos alunos

source: auto assign teachers
pt_pt: atribuir professores automaticamente

source: Automatically assign available teachers to classes
pt_pt: Atribuir automaticamente professores disponíveis às aulas

source: class reminder hours
pt_pt: horas de lembrete de aula

source: Hours before class to send reminder notifications
pt_pt: Horas antes da aula para enviar notificações de lembrete

source: enable calendar integration
pt_pt: ativar integração de calendário

source: Enable integration with external calendar systems
pt_pt: Ativar integração com sistemas de calendário externos

source: calendar integration type
pt_pt: tipo de integração de calendário

source: Type of calendar integration
pt_pt: Tipo de integração de calendário

source: enable email integration
pt_pt: ativar integração de email

source: Enable integration with external email systems
pt_pt: Ativar integração com sistemas de email externos

source: email integration provider
pt_pt: fornecedor de integração de email

source: Email integration provider
pt_pt: Fornecedor de integração de email

source: data retention policy
pt_pt: política de retenção de dados

source: How long to retain student and class data
pt_pt: Por quanto tempo reter dados de alunos e aulas

source: GDPR compliance enabled
pt_pt: conformidade RGPD ativada

source: Enable GDPR compliance features
pt_pt: Ativar recursos de conformidade com RGPD

source: allow data export
pt_pt: permitir exportação de dados

source: Allow users to export their personal data
pt_pt: Permitir aos utilizadores exportar os seus dados pessoais

source: require data processing consent
pt_pt: requerer consentimento de processamento de dados

source: Require explicit consent for data processing
pt_pt: Requerer consentimento explícito para processamento de dados

source: default minimum notice minutes
pt_pt: minutos de aviso mínimo padrão

source: Default minimum notice period in minutes (2 hours)
pt_pt: Período mínimo de aviso padrão em minutos (2 horas)

source: default buffer time minutes
pt_pt: minutos de intervalo padrão

source: Default buffer time between classes in minutes
pt_pt: Tempo de intervalo padrão entre aulas em minutos

source: default max daily bookings
pt_pt: máximo padrão de marcações diárias

source: Default maximum classes per day for teachers
pt_pt: Máximo padrão de aulas por dia para professores

source: default max weekly bookings
pt_pt: máximo padrão de marcações semanais

source: Default maximum classes per week for teachers
pt_pt: Máximo padrão de aulas por semana para professores

source: student max daily bookings
pt_pt: máximo de marcações diárias do aluno

source: Maximum classes per day for students
pt_pt: Máximo de aulas por dia para alunos

source: student max weekly bookings
pt_pt: máximo de marcações semanais do aluno

source: Maximum classes per week for students
pt_pt: Máximo de aulas por semana para alunos

source: buffer time for group classes
pt_pt: tempo de intervalo para aulas de grupo

source: Buffer time in minutes for group classes
pt_pt: Tempo de intervalo em minutos para aulas de grupo

source: buffer time for trial classes
pt_pt: tempo de intervalo para aulas experimentais

source: Buffer time in minutes for trial classes
pt_pt: Tempo de intervalo em minutos para aulas experimentais

source: School Settings
pt_pt: Definições da Escola

source: Monday
pt_pt: Segunda-feira

source: Tuesday
pt_pt: Terça-feira

source: Wednesday
pt_pt: Quarta-feira

source: Thursday
pt_pt: Quinta-feira

source: Friday
pt_pt: Sexta-feira

source: Saturday
pt_pt: Sábado

source: Sunday
pt_pt: Domingo

source: The Email must be set
pt_pt: O email deve ser definido

source: username
pt_pt: nome de utilizador

source: profile photo
pt_pt: fotografia de perfil

source: User profile photo
pt_pt: Fotografia de perfil do utilizador

source: primary contact
pt_pt: contacto principal

source: Phone
pt_pt: Telemóvel

source: email verified
pt_pt: email verificado

source: phone verified
pt_pt: telemóvel verificado

source: email verified at
pt_pt: email verificado em

source: Timestamp when email was verified
pt_pt: Carimbo temporal de quando o email foi verificado

source: phone verified at
pt_pt: telemóvel verificado em

source: Timestamp when phone was verified
pt_pt: Carimbo temporal de quando o telemóvel foi verificado

source: normalized phone number
pt_pt: número de telemóvel normalizado

source: E.164 format phone number for duplicate checking
pt_pt: Número de telemóvel em formato E.164 para verificação de duplicados

source: preferred OTP method
pt_pt: método OTP preferido

source: User's preferred method for receiving OTP codes
pt_pt: Método preferido do utilizador para receber códigos OTP

source: Last time user was active on the platform
pt_pt: Última vez que o utilizador esteve ativo na plataforma

source: verification required after
pt_pt: verificação necessária após

source: After this time, user must verify email/phone to continue accessing the platform
pt_pt: Após este momento, o utilizador deve verificar email/telemóvel para continuar a aceder à plataforma

source: first login completed
pt_pt: primeiro login concluído

source: onboarding completed
pt_pt: integração concluída

source: onboarding progress
pt_pt: progresso da integração

source: tutorial preferences
pt_pt: preferências do tutorial

source: Please enter a valid phone number with country code
pt_pt: Por favor, introduza um número de telemóvel válido com indicativo

source: Email Verification
pt_pt: Verificação de Email

source: Phone Verification
pt_pt: Verificação de Telemóvel

source: Signin OTP
pt_pt: OTP de Entrada

source: User this token belongs to
pt_pt: Utilizador a quem pertence este token

source: token type
pt_pt: tipo de token

source: Type of verification this token is for
pt_pt: Tipo de verificação para o qual este token é usado

source: token value
pt_pt: valor do token

source: Hashed token value for security
pt_pt: Valor do token cifrado para segurança

source: expires at
pt_pt: expira em
