Repository: aprendecomigo-edu/aprendecomigo
Catalog: locale/*/LC_MESSAGES/django.po
Languages: pt_pt

source: Add your first student
pt_pt: Adicione o seu primeiro aluno

source: Add a student to start using the platform
pt_pt: Adicione um aluno para começar a usar a plataforma

source: Educational Platform
pt_pt: Plataforma Educativa

source: You're Invited to Join as a Teacher!
pt_pt: Foi convidado para se juntar como Professor!

source: Hello,
pt_pt: Olá,

source: My Profile
pt_pt: O Meu Perfil

source: Edit Profile
pt_pt: Editar Perfil

source: Your account information and school memberships
pt_pt: As suas informações de conta e membros de escolas

source: School Members
pt_pt: Membros da Escola

source: Members of
pt_pt: Membros de

source: Joined
pt_pt: Inscrito

source: First
pt_pt: Primeiro

source: Previous
pt_pt: Anterior

source: Page
pt_pt: Página

source: of
pt_pt: de

source: Next
pt_pt: Seguinte

source: Last
pt_pt: Último

source: No members found.
pt_pt: Nenhum membro encontrado.

source: Verify Code
pt_pt: Verificar Código

source: Enter the 6-digit code sent to
pt_pt: Introduza o código de 6 dígitos enviado para

source: Need to change your email?
pt_pt: Precisa de alterar o seu email?

source: Go back
pt_pt: Voltar

source: Admin Dashboard
pt_pt: Painel de Administração

source: Hello, %(name)s!
pt_pt: Olá, %(name)s!

source: Upcoming Classes
pt_pt: Próximas Aulas

source: %(counter)s class scheduled
pt_pt: %(counter)s aula agendada

source: Date
pt_pt: Data

source: Time
pt_pt: Hora

source: Class
pt_pt: Aula

source: No classes scheduled
pt_pt: Nenhuma aula agendada

source: Classes will appear here when teachers and students schedule sessions
pt_pt: As aulas aparecerão aqui quando professores e alunos agendarem sessões

source: Add
pt_pt: Adicionar

source: No tasks
pt_pt: Nenhuma tarefa

source: Select school year
pt_pt: Selecionar ano letivo

source: Invitations
pt_pt: Convites

source: Invite teachers to join your school and manage existing invitations
pt_pt: Convide professores para se juntarem à sua escola e gerir convites existentes

source: Invite New Teacher
pt_pt: Convidar Novo Professor

source: Recent Invitations
pt_pt: Convites Recentes

source: Manage and track your teacher invitations
pt_pt: Gira e acompanha os seus convites de professores

source: No invitations yet
pt_pt: Ainda sem convites

source: Get started by inviting your first teacher above.
pt_pt: Comece por convidar o seu primeiro professor acima.

source: Year %(year)s
pt_pt: Ano %(year)s

source: Student Management
pt_pt: Gestão de Alunos

source: No students found. Add students to get started.
pt_pt: Nenhum aluno encontrado. Adicione alunos para começar.

source: No teachers found
pt_pt: Nenhum professor encontrado

source: Add teachers to your school to get started.
pt_pt: Adicione professores à sua escola para começar.

source: Add First Teacher
pt_pt: Adicionar Primeiro Professor

source: People Management
pt_pt: Gestão de Pessoas

source: Staff
pt_pt: Pessoal

source: Add Student
pt_pt: Adicionar Aluno

source: Add Teacher
pt_pt: Adicionar Professor

source: Staff Management
pt_pt: Gestão de Pessoal

source: Staff management functionality coming soon.
pt_pt: Funcionalidade de gestão de pessoal em breve.

source: Student Portal
pt_pt: Portal do Aluno

source: Continue your learning journey
pt_pt: Continue a sua jornada de aprendizagem

source: Active Courses
pt_pt: Cursos Ativos

source: Teacher Dashboard
pt_pt: Painel do Professor

source: Manage your teaching activities and connect with students
pt_pt: Gira as suas atividades de ensino e conecte-se com alunos

source: Active Students
pt_pt: Alunos Ativos

source: Change
pt_pt: Alterar

source: Optional class description
pt_pt: Descrição opcional da aula

source: Start
pt_pt: Iniciar

source: Error
pt_pt: Erro

source: Success
pt_pt: Sucesso

source: Enter task title...
pt_pt: Introduza o título da tarefa...

source: Enter task description...
pt_pt: Introduza a descrição da tarefa...

source: Type
pt_pt: Tipo

source: Mark as urgent
pt_pt: Marcar como urgente

source: Cancel
pt_pt: Cancelar

source: Update Task
pt_pt: Atualizar Tarefa

source: Create Task
pt_pt: Criar Tarefa

source: Urgent
pt_pt: Urgente

source: Overdue
pt_pt: Em Atraso

source: Due Today
pt_pt: Vence Hoje

source: Due Tomorrow
pt_pt: Vence Amanhã

source: days left
pt_pt: dias restantes

source: Are you sure you want to delete this task?
pt_pt: Tem a certeza de que quer apagar esta tarefa?

source: Created
pt_pt: Criada

source: Updated
pt_pt: Atualizada

source: No tasks found
pt_pt: Nenhuma tarefa encontrada

source: No tasks match the current filter.
pt_pt: Nenhuma tarefa corresponde ao filtro atual.

source: Get started by creating your first task.
pt_pt: Comece por criar a sua primeira tarefa.

source: Total Tasks
pt_pt: Total de Tarefas

source: Overdue Tasks
pt_pt: Tarefas em Atraso

source: task
pt_pt: tarefa

source: Urgent Tasks
pt_pt: Tarefas Urgentes

source: Edit Task
pt_pt: Editar Tarefa

source: Back to Tasks
pt_pt: Voltar às Tarefas

source: Last updated
pt_pt: Última atualização

source: Complete
pt_pt: Concluir

source: Reopen
pt_pt: Reabrir

source: Manage your tasks and to-do items
pt_pt: Gira as suas tarefas e itens por fazer

source: New Task
pt_pt: Nova Tarefa

source: All
pt_pt: Todos
