Repository: aprendecomigo-edu/aprendecomigo
Catalog: locale/*/LC_MESSAGES/django.po
Languages: pt_pt

source: When this token expires
pt_pt: Quando este token expira

source: used at
pt_pt: usado em

source: When this token was successfully used
pt_pt: Quando este token foi usado com sucesso

source: attempts
pt_pt: tentativas

source: Number of failed verification attempts
pt_pt: Número de tentativas de verificação falhadas

source: max attempts
pt_pt: máximo de tentativas

source: Maximum allowed attempts before token is locked
pt_pt: Máximo de tentativas permitidas antes do token ser bloqueado

source: created at
pt_pt: criado em

source: Verification Token
pt_pt: Token de Verificação

source: Verification Tokens
pt_pt: Tokens de Verificação

source: Phone number is required
pt_pt: O número de telemóvel é obrigatório

source: Please enter a valid phone number with country code (e.g., +1234567890)
pt_pt: Por favor, introduza um número de telemóvel válido com indicativo (ex: +351912345678)

source: Please include your country code (e.g., +1 for US, +351 for Portugal)
pt_pt: Por favor, inclua o indicativo do país (ex: +1 para EUA, +351 para Portugal)

source: Invalid phone number format
pt_pt: Formato de número de telemóvel inválido

source: You don't have permission to invite teachers to this school.
pt_pt: Não tem permissão para convidar professores para esta escola.

source: Teacher invitation sent to %(email)s
pt_pt: Convite de professor enviado para %(email)s

source: Welcome to %(school)s! You are now a %(role)s.
pt_pt: Bem-vindo à %(school)s! Agora é %(role)s.

source: Your profile has been updated successfully.
pt_pt: O seu perfil foi atualizado com sucesso.

source: Settings for %(school)s have been updated successfully.
pt_pt: As definições da %(school)s foram atualizadas com sucesso.

source: Grade Specific Rate
pt_pt: Tarifa Específica por Ano

source: Group Class Rate
pt_pt: Tarifa de Aula em Grupo

source: Fixed Monthly Salary
pt_pt: Salário Mensal Fixo

source: Base Salary Plus Bonus
pt_pt: Salário Base Mais Bónus

source: Individual Session
pt_pt: Sessão Individual

source: Group Session
pt_pt: Sessão em Grupo

source: Scheduled
pt_pt: Agendado

source: In Progress
pt_pt: Em Progresso

source: Completed
pt_pt: Concluído

source: No Show
pt_pt: Faltou

source: Calculated
pt_pt: Calculado

source: Paid
pt_pt: Pago

source: School Absorbs Cost
pt_pt: Escola Absorve o Custo

source: Teacher Absorbs Cost
pt_pt: Professor Absorve o Custo

source: Split Cost 50/50
pt_pt: Dividir Custo 50/50

source: Weekly
pt_pt: Semanal

source: Bi-weekly
pt_pt: Quinzenal

source: Monthly
pt_pt: Mensal

source: Received
pt_pt: Recebido

source: Processing
pt_pt: A processar

source: Processed
pt_pt: Processado

source: Retrying
pt_pt: A tentar novamente

source: Package
pt_pt: Pacote

source: Subscription
pt_pt: Subscrição

source: Grade level is required for grade-specific rules
pt_pt: Nível de ensino é obrigatório para regras específicas de ano

source: Rate per hour is required for grade-specific rules
pt_pt: Taxa por hora é obrigatória para regras específicas de ano

source: Rate per hour is required for group class rules
pt_pt: Taxa por hora é obrigatória para regras de aulas de grupo

source: Fixed amount is required for fixed salary rules
pt_pt: Montante fixo é obrigatório para regras de salário fixo

source: Whether guardian approval is required for booking individual sessions
pt_pt: Se a aprovação do encarregado é necessária para reservar sessões individuais

source: Whether guardian approval is required for purchasing hour packages
pt_pt: Se a aprovação do encarregado é necessária para comprar pacotes de horas

source: Timestamp when the event was successfully processed
pt_pt: Carimbo temporal de quando o evento foi processado com sucesso

source: error message
pt_pt: mensagem de erro

source: Error message if processing failed
pt_pt: Mensagem de erro se o processamento falhasse

source: Administrator who performed this action
pt_pt: Administrador que realizou esta ação

source: target user
pt_pt: utilizador alvo

source: User affected by this action (if applicable)
pt_pt: Utilizador afetado por esta ação (se aplicável)

source: target transaction
pt_pt: transação alvo

source: Transaction affected by this action (if applicable)
pt_pt: Transação afetada por esta ação (se aplicável)

source: target dispute
pt_pt: disputa alvo

source: Dispute affected by this action (if applicable)
pt_pt: Disputa afetada por esta ação (se aplicável)

source: success
pt_pt: sucesso

source: Whether the action was successful
pt_pt: Se a ação foi bem-sucedida

source: result message
pt_pt: mensagem de resultado

source: Result message or error details
pt_pt: Mensagem de resultado ou detalhes de erro

source: amount impacted
pt_pt: valor impactado

source: Financial amount impacted by this action
pt_pt: Montante financeiro impactado por esta ação

source: action data
pt_pt: dados da ação

source: Detailed data about the action performed
pt_pt: Dados detalhados sobre a ação realizada

source: Stripe reference ID
pt_pt: ID de referência Stripe

source: Related Stripe object ID (if applicable)
pt_pt: ID do objeto Stripe relacionado (se aplicável)

source: IP address
pt_pt: endereço IP

source: IP address from which the action was performed
pt_pt: Endereço IP de onde a ação foi realizada

source: user agent
pt_pt: agente de utilizador

source: User agent of the client that performed the action
pt_pt: Agente de utilizador do cliente que realizou a ação

source: two factor verified
pt_pt: dois fatores verificado

source: Whether two-factor authentication was verified
pt_pt: Se a autenticação de dois fatores foi verificada

source: Admin Action
pt_pt: Ação de Administrador

source: Admin Actions
pt_pt: Ações de Administrador

source: alert ID
pt_pt: ID do alerta

source: Unique identifier for this fraud alert
pt_pt: Identificador único para este alerta de fraude

source: severity
pt_pt: gravidade

source: Severity level of the fraud alert
pt_pt: Nível de gravidade do alerta de fraude

source: Current status of the fraud alert
pt_pt: Estado atual do alerta de fraude

source: alert type
pt_pt: tipo de alerta

source: Type of fraud pattern detected
pt_pt: Tipo de padrão de fraude detetado

source: Detailed description of the suspicious activity
pt_pt: Descrição detalhada da atividade suspeita

source: User associated with this fraud alert
pt_pt: Utilizador associado a este alerta de fraude

source: related transactions
pt_pt: transações relacionadas

source: Transactions that triggered this alert
pt_pt: Transações que desencadearam este alerta

source: detection data
pt_pt: dados de deteção

source: Data used to detect this fraud pattern
pt_pt: Dados utilizados para detetar este padrão de fraude

source: risk score
pt_pt: pontuação de risco

source: Risk assessment score (0-100)
pt_pt: Pontuação de avaliação de risco (0-100)

source: assigned to
pt_pt: atribuído a

source: Administrator assigned to investigate this alert
pt_pt: Administrador atribuído para investigar este alerta

source: investigated at
pt_pt: investigado em

source: When the alert was investigated
pt_pt: Quando o alerta foi investigado

source: resolution notes
pt_pt: notas de resolução

source: Notes about how this alert was resolved
pt_pt: Notas sobre como este alerta foi resolvido

source: actions taken
pt_pt: ações tomadas

source: List of actions taken in response to this alert
pt_pt: Lista de ações tomadas em resposta a este alerta

source: Fraud Alerts
pt_pt: Alertas de Fraude

source: Low Balance
pt_pt: Saldo Baixo

source: Package Expiring
pt_pt: Pacote a Expirar

source: Balance Depleted
pt_pt: Saldo Esgotado

source: user
pt_pt: utilizador

source: User who will receive this notification
pt_pt: Utilizador que receberá esta notificação

source: notification type
pt_pt: tipo de notificação

source: Type of notification
pt_pt: Tipo de notificação

source: title
pt_pt: título

source: Notification title
pt_pt: Título da notificação

source: message
pt_pt: mensagem

source: Notification message content
pt_pt: Conteúdo da mensagem de notificação

source: is read
pt_pt: foi lida

source: Whether the notification has been read
pt_pt: Se a notificação foi lida

source: read at
pt_pt: lida em

source: Timestamp when notification was read
pt_pt: Carimbo temporal de quando a notificação foi lida

source: related transaction
pt_pt: transação relacionada

source: Purchase transaction related to this notification (for package expiration)
pt_pt: Transação de compra relacionada com esta notificação (para expiração de pacote)

source: Additional notification data in JSON format
pt_pt: Dados adicionais de notificação em formato JSON

source: Notification
pt_pt: Notificação

source: Notifications
pt_pt: Notificações

source: Bounced
pt_pt: Devolvido

source: Marked as Spam
pt_pt: Marcado como Spam

source: Invitation
pt_pt: Convite

source: Reminder
pt_pt: Lembrete

source: Welcome
pt_pt: Boas-vindas

source: Profile Reminder
pt_pt: Lembrete de Perfil

source: Completion Celebration
pt_pt: Celebração de Conclusão

source: Ongoing Support
pt_pt: Apoio Contínuo

source: Low Balance Alert
pt_pt: Alerta de Saldo Baixo

source: Package Expiring Alert
pt_pt: Alerta de Pacote a Expirar

source: Automated
pt_pt: Automático

source: Sequence
pt_pt: Sequência

source: School this template belongs to
pt_pt: Escola a que este modelo pertence

source: template type
pt_pt: tipo de modelo

source: Type of email template
pt_pt: Tipo de modelo de e-mail

source: template name
pt_pt: nome do modelo

source: Human-readable name for the template
pt_pt: Nome legível para o modelo

source: subject template
pt_pt: modelo de assunto

source: Email subject with template variables like {{teacher_name}}
pt_pt: Assunto do e-mail com variáveis de modelo como {{teacher_name}}

source: HTML content
pt_pt: conteúdo HTML

source: HTML email content with template variables
pt_pt: Conteúdo HTML do e-mail com variáveis de modelo

source: text content
pt_pt: conteúdo de texto

source: Plain text email content with template variables
pt_pt: Conteúdo de texto simples do e-mail com variáveis de modelo

source: use school branding
pt_pt: usar identidade da escola

source: Apply school colors and logo to template
pt_pt: Aplicar cores e logo da escola ao modelo

source: custom CSS
pt_pt: CSS personalizado

source: Additional CSS for template customization
pt_pt: CSS adicional para personalização do modelo

source: Whether this template is active and can be used
pt_pt: Se este modelo está ativo e pode ser usado

source: Whether this is the default template for this type
pt_pt: Se este é o modelo padrão para este tipo

source: User who created this template
pt_pt: Utilizador que criou este modelo

source: School Email Template
pt_pt: Modelo de E-mail da Escola

source: School Email Templates
pt_pt: Modelos de E-mail da Escola

source: Only one default template per school and type is allowed
pt_pt: Apenas um modelo padrão por escola e tipo é permitido

source: Template security validation failed: %(error)s
pt_pt: Validação de segurança do modelo falhada: %(error)s

source: Custom CSS contains dangerous pattern: %(pattern)s
pt_pt: CSS personalizado contém padrão perigoso: %(pattern)s

source: Custom CSS too large. Maximum size is 10KB
pt_pt: CSS personalizado demasiado grande. Tamanho máximo é 10KB

source: School this sequence belongs to
pt_pt: Escola a que esta sequência pertence

source: sequence name
pt_pt: nome da sequência

source: Human-readable name for the sequence
pt_pt: Nome legível para a sequência

source: Description of what this sequence does
pt_pt: Descrição do que esta sequência faz

source: trigger event
pt_pt: evento desencadeador

source: Invitation Viewed
pt_pt: Convite Visualizado

source: Profile Incomplete
pt_pt: Perfil Incompleto

source: Profile Completed
pt_pt: Perfil Completo

source: Event that triggers this sequence
pt_pt: Evento que desencadeia esta sequência

source: Whether this sequence is active
pt_pt: Se esta sequência está ativa

source: maximum emails
pt_pt: e-mails máximos

source: Maximum number of emails to send in this sequence
pt_pt: Número máximo de e-mails a enviar nesta sequência

source: Email Sequence
pt_pt: Sequência de E-mail

source: Email Sequences
pt_pt: Sequências de E-mail

source: Email sequence this step belongs to
pt_pt: Sequência de e-mail a que este passo pertence

source: Email template to use for this step
pt_pt: Modelo de e-mail a usar para este passo

source: step number
pt_pt: número do passo

source: Order of this step in the sequence
pt_pt: Ordem deste passo na sequência

source: delay hours
pt_pt: horas de atraso

source: Hours to wait before sending this email
pt_pt: Horas a esperar antes de enviar este e-mail

source: send condition
pt_pt: condição de envio

source: Always Send
pt_pt: Enviar Sempre

source: If No Response
pt_pt: Se Sem Resposta

source: If Not Accepted
pt_pt: Se Não Aceite

source: If Profile Incomplete
pt_pt: Se Perfil Incompleto

source: Condition that must be met to send this email
pt_pt: Condição que deve ser cumprida para enviar este e-mail

source: Whether this step is active
pt_pt: Se este passo está ativo

source: Email Sequence Step
pt_pt: Passo da Sequência de E-mail

source: Email Sequence Steps
pt_pt: Passos da Sequência de E-mail

source: User who received the email (if registered)
pt_pt: Utilizador que recebeu o e-mail (se registado)

source: recipient email
pt_pt: e-mail do destinatário

source: Email address of the recipient
pt_pt: Endereço de e-mail do destinatário

source: School that sent the email
pt_pt: Escola que enviou o e-mail

source: Template used for this email
pt_pt: Modelo usado para este e-mail

source: Type of email template used
pt_pt: Tipo de modelo de e-mail usado

source: email subject
pt_pt: assunto do e-mail

source: Rendered email subject
pt_pt: Assunto do e-mail renderizado

source: communication type
pt_pt: tipo de comunicação

source: Type of communication
pt_pt: Tipo de comunicação

source: Email sequence this belongs to (if automated)
pt_pt: Sequência de e-mail a que isto pertence (se automático)

source: Sequence step this email represents
pt_pt: Passo da sequência que este e-mail representa

source: delivery status
pt_pt: estado de entrega

source: Current delivery status
pt_pt: Estado atual de entrega

source: failure reason
pt_pt: razão da falha

source: Reason for delivery failure
pt_pt: Razão para a falha de entrega

source: Number of delivery attempts
pt_pt: Número de tentativas de entrega

source: maximum retries
pt_pt: tentativas máximas

source: Maximum number of retry attempts
pt_pt: Número máximo de tentativas de repetição

source: Related teacher invitation (if applicable)
pt_pt: Convite de professor relacionado (se aplicável)

source: User who initiated this communication
pt_pt: Utilizador que iniciou esta comunicação

source: Email Communication
pt_pt: Comunicação por E-mail

source: Email Communications
pt_pt: Comunicações por E-mail

source: Group
pt_pt: Grupo

source: Trial
pt_pt: Experimental

source: Confirmed
pt_pt: Confirmada

source: Rejected
pt_pt: Rejeitada

source: School context for this availability
pt_pt: Contexto escolar para esta disponibilidade

source: day of week
pt_pt: dia da semana

source: End time must be after start time.
pt_pt: A hora de fim deve ser posterior à hora de início.

source: School context for this unavailability
pt_pt: Contexto escolar para esta indisponibilidade

source: reason
pt_pt: razão

source: all day
pt_pt: todo o dia

source: Cannot create unavailability for past dates.
pt_pt: Não é possível criar indisponibilidade para datas passadas.

source: Start time and end time are required for partial day unavailability.
pt_pt: Hora de início e hora de fim são obrigatórias para indisponibilidade parcial.

source: Student participating in this class
pt_pt: Aluno participante nesta aula

source: class type
pt_pt: tipo de aula

source: scheduled date
pt_pt: data agendada

source: duration in minutes
pt_pt: duração em minutos

source: User who booked this class
pt_pt: Utilizador que reservou esta aula

source: booked at
pt_pt: reservado em

source: Additional students for group classes
pt_pt: Alunos adicionais para aulas de grupo

source: User who cancelled this class
pt_pt: Utilizador que cancelou esta aula

source: cancellation reason
pt_pt: razão de cancelamento

source: completed at
pt_pt: concluída em

source: User who marked this class as completed
pt_pt: Utilizador que marcou esta aula como concluída

source: actual duration in minutes
pt_pt: duração real em minutos

source: completion notes
pt_pt: notas de conclusão

source: marked no-show at
pt_pt: marcado como faltoso em

source: User who marked this class as no-show
pt_pt: Utilizador que marcou esta aula como faltosa

source: no-show reason
pt_pt: razão da falta

source: confirmed at
pt_pt: confirmada em

source: User who confirmed this class
pt_pt: Utilizador que confirmou esta aula

source: rejected at
pt_pt: rejeitada em

source: User who rejected this class
pt_pt: Utilizador que rejeitou esta aula

source: maximum participants
pt_pt: participantes máximos

source: Maximum number of participants allowed for group classes
pt_pt: Número máximo de participantes permitidos para aulas de grupo

source: Additional structured metadata for the class
pt_pt: Metadados estruturados adicionais para a aula

source: Recurring schedule that generated this instance
pt_pt: Horário recorrente que gerou esta instância

source: teacher notes
pt_pt: notas do professor

source: student notes
pt_pt: notas do aluno

source: Cannot schedule classes in the past.
pt_pt: Não é possível agendar aulas no passado.

source: Max participants is required for group classes.
pt_pt: Número máximo de participantes é obrigatório para aulas de grupo.

source: Max participants must be a positive integer.
pt_pt: Número máximo de participantes deve ser um número inteiro positivo.

source: Student must be a member of the school.
pt_pt: O aluno deve ser membro da escola.

source: Teacher must be a member of the school.
pt_pt: O professor deve ser membro da escola.

source: Biweekly
pt_pt: Quinzenal

source: Paused
pt_pt: Pausado

source: Confirmation
pt_pt: Confirmação

source: 24 Hours Before
pt_pt: 24 Horas Antes

source: 1 Hour Before
pt_pt: 1 Hora Antes

source: 15 Minutes Before
pt_pt: 15 Minutos Antes

source: Cancellation
pt_pt: Cancelamento

source: Schedule Change
pt_pt: Mudança de Horário

source: Push Notification
pt_pt: Notificação Push

source: In-App Notification
pt_pt: Notificação na App

source: Students participating in this recurring class
pt_pt: Alunos participantes nesta aula recorrente

source: frequency type
pt_pt: tipo de frequência

source: Maximum number of participants for group classes
pt_pt: Número máximo de participantes para aulas de grupo

source: start date
pt_pt: data de início

source: end date
pt_pt: data de fim

source: User who cancelled this recurring series
pt_pt: Utilizador que cancelou esta série recorrente

source: paused at
pt_pt: pausado em

source: User who paused this recurring series
pt_pt: Utilizador que pausou esta série recorrente

source: End date must be after start date.
pt_pt: A data de fim deve ser posterior à data de início.

source: Individual classes can only have one student.
pt_pt: Aulas individuais só podem ter um aluno.

source: School-specific preferences (null for global preferences)
pt_pt: Preferências específicas da escola (nulo para preferências globais)

source: reminder timing hours
pt_pt: horas de tempo de lembrete

source: List of hours before class to send reminders (e.g., [24, 2, 0.5])
pt_pt: Lista de horas antes da aula para enviar lembretes (ex: [24, 2, 0.5])

source: communication channels
pt_pt: canais de comunicação

source: List of preferred communication channels
pt_pt: Lista de canais de comunicação preferidos

source: timezone preference
pt_pt: preferência de fuso horário

source: User's preferred timezone (e.g., 'America/New_York')
pt_pt: Fuso horário preferido do utilizador (ex: 'America/New_York')

source: Whether reminders are enabled for this user
pt_pt: Se os lembretes estão ativados para este utilizador

source: is school default
pt_pt: é padrão da escola

source: Whether this is the default preference template for the school
pt_pt: Se este é o modelo de preferência padrão para a escola

source: Must be a list of numbers
pt_pt: Deve ser uma lista de números

source: Hours must be numbers between 0 and 168
pt_pt: As horas devem ser números entre 0 e 168

source: Must be a list of channel names
pt_pt: Deve ser uma lista de nomes de canais

source: Invalid channel. Must be one of: {}
pt_pt: Canal inválido. Deve ser um de: {}

source: Invalid timezone
pt_pt: Fuso horário inválido

source: reminder type
pt_pt: tipo de lembrete

source: User who will receive this reminder
pt_pt: Utilizador que receberá este lembrete

source: recipient type
pt_pt: tipo de destinatário

source: Admin
pt_pt: Administrador

source: Role of the recipient in the class context
pt_pt: Função do destinatário no contexto da aula

source: communication channel
pt_pt: canal de comunicação

source: Channel used to send this reminder
pt_pt: Canal usado para enviar este lembrete

source: scheduled for
pt_pt: agendado para

source: When this reminder should be sent (UTC)
pt_pt: Quando este lembrete deve ser enviado (UTC)

source: sent at
pt_pt: enviado em

source: When this reminder was actually sent
pt_pt: Quando este lembrete foi realmente enviado

source: subject
pt_pt: assunto

source: Email subject or notification title
pt_pt: Assunto do e-mail ou título da notificação

source: Reminder message content
pt_pt: Conteúdo da mensagem de lembrete

source: Error message if sending failed
pt_pt: Mensagem de erro se o envio falhou

source: Number of times sending was retried
pt_pt: Número de vezes que o envio foi repetido

source: external message ID
pt_pt: ID da mensagem externa

source: ID from external communication service
pt_pt: ID do serviço de comunicação externo

source: Additional data for the reminder
pt_pt: Dados adicionais para o lembrete

source: Scheduled time must be in the future
pt_pt: A hora agendada deve ser no futuro

source: Retry count cannot exceed max retries
pt_pt: Número de tentativas não pode exceder o máximo

source: Onboarding
pt_pt: Integração

source: Assignment
pt_pt: Atribuição

source: Personal
pt_pt: Pessoal

source: System
pt_pt: Sistema

source: Add First Student
pt_pt: Adicionar Primeiro Aluno

source: Title
pt_pt: Título

source: Description
pt_pt: Descrição

source: User
pt_pt: Utilizador

source: Status
pt_pt: Estado

source: Priority
pt_pt: Prioridade

source: Task Type
pt_pt: Tipo de Tarefa

source: Due Date
pt_pt: Data de Vencimento

source: Completed At
pt_pt: Concluída Em

source: Created At
pt_pt: Criada Em

source: Updated At
pt_pt: Atualizada Em

source: Is Urgent
pt_pt: É Urgente

source: Is System Generated
pt_pt: É Gerada pelo Sistema

source: True if this task was automatically created by the system
pt_pt: Verdadeiro se esta tarefa foi automaticamente criada pelo sistema

source: System Code
pt_pt: Código do Sistema

source: Unique identifier for system-generated tasks
pt_pt: Identificador único para tarefas geradas pelo sistema

source: Task
pt_pt: Tarefa

source: Tasks
pt_pt: Tarefas

source: Comment
pt_pt: Comentário

source: Task Comment
pt_pt: Comentário da Tarefa

source: Task Comments
pt_pt: Comentários da Tarefa

source: Verify your email address
pt_pt: Verifique o seu endereço de e-mail

source: Click the verification link sent to your email
pt_pt: Clique na ligação de verificação enviada para o seu e-mail

source: Verify your phone number
pt_pt: Verifique o seu número de telefone

source: Enter the SMS code to verify your phone
pt_pt: Introduza o código SMS para verificar o seu telefone
